{"Error":"0","Time":0.0306,"Total":"1542","Page":1,"Books":[{"ID":2563063616,"Title":"The Modern Web","SubTitle":"Multi-Device Web Development with HTML5, CSS3, and JavaScript","Description":"Today's web technologies are evolving at nearu2013light speed, bringing the promise of a seamless Internet ever closer to reality. When users can browse the Web on a three-inch phone screen as easily as on a fifty-inch HDTV, what's a developer to do? ...","Image":"http://s.it-ebooks-api.info/15/the_modern_web.jpg","isbn":"9781593274870"},{"ID":890604204,"Title":"Web Design Blueprints","SubTitle":"Build websites and applications using the latest techniques in modern web development","Description":"The book delivers simple instructions on how to design and build modern Web using the latest trends in web development. You will learn how to design responsive websites, created with modern Flat User Interface design patterns, build deep-scrolling we ...","Image":"http://s.it-ebooks-api.info/14/web_design_blueprints.jpg","isbn":"9781783552115"},{"ID":421958423,"Title":"Getting Started with Meteor.js JavaScript Framework","SubTitle":"Develop modern web applications in Meteor, one of the hottest new JavaScript platforms","Description":"Meteor is a brand new platform built entirely in JavaScript that allows you to build modern, dynamic web applications in the blink of an eye. With support for nearly every popular JavaScript framework (and more being added every day), Meteor provides ...","Image":"http://s.it-ebooks-api.info/14/getting_started_with_meteor.js_javascript_framework.jpg","isbn":"9781782160823"},{"ID":1356872388,"Title":"JavaScript Frameworks for Modern Web Dev","Description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development.nnThe JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an ...","Image":"http://s.it-ebooks-api.info/6/javascript_frameworks_for_modern_web_dev.jpg","isbn":"9781484206638"},{"ID":3143079455,"Title":"Mastering React","SubTitle":"Master the art of building modern web applications using React","Description":"React stands out in the web framework crowd through its approach to composition. This approach yields blazingly fast rendering capabilities. This book will help you understand what makes React special. It starts with the fundamentals and uses a pragm ...","Image":"http://s.it-ebooks-api.info/14/mastering_react.jpg","isbn":"9781783558568"},{"ID":2835931246,"Title":"Mastering Yii","SubTitle":"Advance your modern web application development skills with Yii Framework 2","Description":"The successor of Yii Framework 1.1, Yii2 is a complete rewrite of Yii Framework, one of the most popular PHP 5 frameworks for making modern web applications. The update embraces the best practices and protocols established with newer versions of PHP, ...","Image":"http://s.it-ebooks-api.info/14/mastering_yii.jpg","isbn":"9781785882425"},{"ID":2213017675,"Title":"Modern JavaScript Applications","SubTitle":"An example-driven guide that explores the world of modern web development with JavaScript","Description":"Over the years, JavaScript has become vital to the development of a wide range of applications with different architectures. But JS moves lightning fast, and it's easy to fall behind. Modern JavaScript Applications is designed to get you exploring th ...","Image":"http://s.it-ebooks-api.info/14/modern_javascript_applications.jpg","isbn":"9781785881442"},{"ID":1425607065,"Title":"PHP Web Services","SubTitle":"APIs for the Modern Web","Description":"Whether you're sharing data between two internal systems or building an API so users can access their data, this practical book provides everything you need to build web service APIs with PHP. Author Lorna Jane Mitchell uses code samples, real-world ...","Image":"http://s.it-ebooks-api.info/3/php_web_services.jpg","isbn":"9781449356569"},{"ID":2082674516,"Title":"Web Development with Clojure","SubTitle":"Build Bulletproof Web Apps with Less Code","Description":"If the usual patchwork of web development tools and languages just isn't cutting it for you, you need Web Development With Clojure. Clojure gives you the rich infrastructure of the JVM with the expressive power of a modern functional language. It com ...","Image":"http://s.it-ebooks-api.info/1/web_development_with_clojure.jpg","isbn":"9781937785642"},{"ID":1114209070,"Title":"Seven Web Frameworks in Seven Weeks","SubTitle":"Adventures in Better Web Apps","Description":"Whether you need a new tool or just inspiration, Seven Web Frameworks in Seven Weeks explores modern options, giving you a taste of each with ideas that will help you create better apps. You'll see frameworks that leverage modern programming language ...","Image":"http://s.it-ebooks-api.info/1/seven_web_frameworks_in_seven_weeks.jpg","isbn":"9781937785635"}]}